Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
  taskENTER_CRITICAL();
  scope_channel_index = channel - 1U;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

uint8_t AD7606_ScopeSetMvPerDiv(uint32_t mv_per_div)
{
  if ((mv_per_div != 50U) && (mv_per_div != 100U) &&
      (mv_per_div != 200U) && (mv_per_div != 500U) &&
      (mv_per_div != 1000U) && (mv_per_div != 2000U))
  {
    return 0U;
  }

  scope_mv_per_div = mv_per_div;
  return 1U;
}

uint8_t AD7606_ScopeSetDecimation(uint32_t decimation)
{
  if ((decimation != 1U) && (decimation != 2U) &&
      (decimation != 4U) && (decimation != 8U) &&
      (decimation != 16U) && (decimation != 32U))
  {
    return 0U;
  }

  taskENTER_CRITICAL();
  scope_decimation = decimation;
  scope_write_count = 0U;
  scope_decimation_count = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

uint8_t AD7606_ScopeSetCenterMv(int32_t center_mv)
{
  if ((center_mv < -(int32_t)scope_full_scale_mv) ||
      (center_mv > (int32_t)scope_full_scale_mv))
  {
    return 0U;
  }

  taskENTER_CRITICAL();
  scope_center_mv = center_mv;
  scope_center_auto = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

void AD7606_ScopeSetCenterAuto(uint8_t automatic)
{
  taskENTER_CRITICAL();
  scope_center_auto = (automatic != 0U) ? 1U : 0U;
  taskEXIT_CRITICAL();
}

uint8_t AD7606_ScopeSetTimePerDivUs(uint32_t time_per_div_us)
{
  if ((time_per_div_us != 0U) &&
      ((time_per_div_us < 10U) || (time_per_div_us > 1000000U)))
  {
    return 0U;
  }

  scope_time_per_div_us = time_per_div_us;
  return 1U;
}

uint8_t AD7606_ScopeSetRefreshMs(uint32_t refresh_ms)
{
  if ((refresh_ms < 250U) || (refresh_ms > 2000U))
  {
    return 0U;
  }

  scope_refresh_ms = refresh_ms;
  return 1U;
}

void AD7606_ScopeSetRunning(uint8_t running)
{
  taskENTER_CRITICAL();
  if ((running != 0U) && (scope_running == 0U))
  {
    scope_write_count = 0U;
    scope_decimation_count = 0U;
  }
  scope_running = (running != 0U) ? 1U : 0U;
  taskEXIT_CRITICAL();
}

uint32_t AD7606_ScopeGetRefreshMs(void)
{
  return scope_refresh_ms;
}

uint32_t AD7606_ScopeGetInputSampleRateHz(void)
{
  return scope_input_sample_rate_hz;
}

uint8_t AD7606_ScopeGetMeasurements(
    AD7606_ScopeMeasurements *measurements)
{
  if (measurements == NULL)
  {
    return 0U;
  }

  taskENTER_CRITICAL();
  *measurements = scope_measurements;
  taskEXIT_CRITICAL();
  return measurements->valid;
}

uint8_t AD7606_ScopeAutoConfigure(void)
{
  static const uint32_t vdiv_options[] =
      {50U, 100U, 200U, 500U, 1000U, 2000U};
  uint32_t count = ScopeTakeSnapshot(scope_auto_samples, NULL);
  int16_t minimum;
  int16_t maximum;
  int32_t midpoint;
  int32_t positive_peak;
  int32_t negative_peak;
  uint32_t peak_mv;
  uint32_t selected_vdiv = 2000U;

  if (count < SCOPE_GRAPH_WIDTH)
  {
    return 0U;
  }

  minimum = scope_auto_samples[0];
  maximum = scope_auto_samples[0];
  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_auto_samples[i];
    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
  }
  midpoint = ((int32_t)maximum + minimum) / 2;
  positive_peak = (int32_t)maximum - midpoint;
  negative_peak = midpoint - (int32_t)minimum;
  peak_mv = (uint32_t)ScopeRawToMv(
      (positive_peak > negative_peak) ? positive_peak : negative_peak);

  for (uint32_t i = 0U;
       i < (sizeof(vdiv_options) / sizeof(vdiv_options[0])); ++i)
  {
    if (peak_mv <= (vdiv_options[i] * 3U))
    {
      selected_vdiv = vdiv_options[i];
      break;
    }
  }

  /*
   * Keep the user's decimation setting. Automatic timebase selection is
   * handled by the LCD renderer and does not alter the 8 MHz ADC clock.
   */
  taskENTER_CRITICAL();
  scope_mv_per_div = selected_vdiv;
  scope_center_mv = ScopeRawToMv(midpoint);
  scope_center_auto = 1U;
  scope_time_per_div_us = 0U;
  taskEXIT_CRITICAL();
  return 1U;
}

void AD7606_ScopeDisplayInit(void)
{
  LCD_SetDirection(Direction_V);
  LCD_SetBackColor(LCD_BLACK);
  LCD_SetColor(LCD_WHITE);
  LCD_SetAsciiFont(&ASCII_Font12);
  LCD_ShowNumMode(Fill_Space);

  ScopeDisplayText(2U, "V:---mV  A:---mV");
  ScopeDisplayText(16U, "F:---Hz  100mV/div");

  ScopeClearGraph();
  ScopeDrawGrid();
  ScopeBlitGraph();
}

void AD7606_ScopeDisplayRefresh(void)
{
  AD7606_ScopeConfig config;
  uint32_t count =
      ScopeTakeSnapshot(scope_snapshot_samples, scope_snapshot_cycles);

  AD7606_ScopeGetConfig(&config);
  if (count < SCOPE_GRAPH_WIDTH)
  {
    char line[40];
    (void)snprintf(line, sizeof(line), "%sCH%u  waiting for signal",
                   (config.running != 0U) ? "" : "HOLD ",
                   config.channel);
    ScopeDisplayText(2U, line);
    return;
  }

  ScopeAnalyzeAndRender(count, &config);
}

static uint32_t ScopeTakeSnapshot(int16_t *samples, uint32_t *cycles)
{
  /*
   * Keep enough unused ring entries ahead of the snapshot so the acquisition
   * task can append the next DMA block while the LCD copies history.
   */
  for (uint32_t attempt = 0U; attempt < SCOPE_SNAPSHOT_RETRIES; ++attempt)
  {
    uint32_t end = scope_write_count;
    uint32_t count = (end < SCOPE_SNAPSHOT_LIMIT) ?
                     end : SCOPE_SNAPSHOT_LIMIT;
    uint32_t first = end - count;

    for (uint32_t i = 0U; i < count; ++i)
    {
      uint32_t source = (first + i) & SCOPE_RING_MASK;
      samples[i] = scope_ring_samples[source];
      if (cycles != NULL)
      {
        cycles[i] = scope_ring_cycles[source];
      }
    }

    __DMB();
    if ((scope_write_count - end) <= (SCOPE_RING_SIZE - count))
    {
      return count;
    }
  }
  return 0U;
}

static void ScopeAnalyzeMeasurements(const int16_t *samples, uint32_t count,
                                     uint32_t input_sample_rate_hz)
{
  int16_t minimum;
  int16_t maximum;
  int64_t sum = 0;
  uint64_t sum_squares = 0U;
  int32_t mean;
  int32_t hysteresis;
  uint64_t variance;
  uint32_t rms_raw;
  uint64_t first_crossing_q16 = 0U;
  uint64_t last_crossing_q16 = 0U;
  uint32_t crossing_count = 0U;
  uint32_t frequency_millihz = 0U;
  uint8_t trigger_armed = 0U;

  if ((samples == NULL) || (count < 3U) || (input_sample_rate_hz == 0U))
  {
    return;
  }

