Dony-kylin/STM32H743/Expand/Src/ad7606_scope.c
  minimum = samples[0];
  maximum = samples[0];
  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = samples[i];

    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
    sum += value;
    sum_squares += (uint64_t)((int64_t)value * value);
  }

  mean = (int32_t)(sum / (int64_t)count);
  {
    int64_t mean_square = (int64_t)(sum_squares / count);
    int64_t dc_square = (int64_t)mean * mean;
    variance = (mean_square > dc_square) ?
               (uint64_t)(mean_square - dc_square) : 0U;
  }
  rms_raw = ScopeIntegerSqrt(variance);

  /*
   * Use the whole 16384-point block instead of only the last six periods.
   * At 500 kHz and 8 MSPS this averages about 1023 periods. Q16 linear
   * interpolation removes the remaining one-sample crossing quantization.
   */
  hysteresis = ((int32_t)maximum - (int32_t)minimum) / 20;
  if (hysteresis < 8)
  {
    hysteresis = 8;
  }

  for (uint32_t i = 1U; i < count; ++i)
  {
    int32_t previous = samples[i - 1U];
    int32_t current = samples[i];

    if (current <= (mean - hysteresis))
    {
      trigger_armed = 1U;
    }
    else if ((trigger_armed != 0U) &&
             (current >= (mean + hysteresis)))
    {
      int32_t threshold = mean + hysteresis;
      int32_t delta = current - previous;
      uint32_t fraction_q16 = 0U;
      uint64_t crossing_q16;

      if ((delta > 0) && (previous < threshold))
      {
        int64_t numerator =
            ((int64_t)threshold - previous) << 16U;
        uint64_t fraction = (uint64_t)(numerator / delta);
        fraction_q16 = (fraction < 65536U) ?
                       (uint32_t)fraction : 65535U;
      }

      crossing_q16 =
          ((uint64_t)(i - 1U) << 16U) + fraction_q16;
      if (crossing_count == 0U)
      {
        first_crossing_q16 = crossing_q16;
      }
      last_crossing_q16 = crossing_q16;
      ++crossing_count;
      trigger_armed = 0U;
    }
  }

  if ((crossing_count >= 2U) &&
      (last_crossing_q16 > first_crossing_q16))
  {
    uint64_t periods = crossing_count - 1U;
    uint64_t span_q16 = last_crossing_q16 - first_crossing_q16;
    uint64_t numerator =
        (uint64_t)input_sample_rate_hz * 1000U * periods;

    frequency_millihz =
        (uint32_t)((numerator << 16U) / span_q16);
  }

  {
    uint32_t peak_to_peak_mv = (uint32_t)ScopeRawToMv(
        (int32_t)maximum - (int32_t)minimum);
    AD7606_ScopeMeasurements measurements;

    measurements.voltage_mv =
        ScopeRawToMv(samples[count - 1U]);
    measurements.dc_mv = ScopeRawToMv(mean);
    measurements.amplitude_mv = (peak_to_peak_mv + 1U) / 2U;
    measurements.peak_to_peak_mv = peak_to_peak_mv;
    measurements.rms_mv = (uint32_t)ScopeRawToMv((int32_t)rms_raw);
    measurements.frequency_millihz = frequency_millihz;
    measurements.sample_rate_hz = input_sample_rate_hz;
    measurements.valid = 1U;

    taskENTER_CRITICAL();
    scope_measurements = measurements;
    taskEXIT_CRITICAL();
  }
}

static void ScopeAnalyzeAndRender(uint32_t count,
                                  const AD7606_ScopeConfig *config)
{
  int16_t minimum = scope_snapshot_samples[0];
  int16_t maximum = scope_snapshot_samples[0];
  int64_t sum = 0;
  uint64_t sum_squares = 0U;
  int32_t mean;
  int32_t display_center_mv;
  uint64_t variance;
  uint32_t rms_raw;
  uint32_t display_sample_rate_hz = 0U;
  uint32_t input_sample_rate_hz = 0U;
  uint32_t frequency_millihz = 0U;
  uint32_t crossings[16];
  uint32_t crossing_count = 0U;
  uint32_t period_samples = 0U;
  uint32_t plot_span = SCOPE_GRAPH_WIDTH - 1U;
  uint32_t plot_start = count - SCOPE_GRAPH_WIDTH;
  int32_t hysteresis;
  uint8_t trigger_armed = 0U;
  char line[64];

  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value < minimum)
    {
      minimum = (int16_t)value;
    }
    if (value > maximum)
    {
      maximum = (int16_t)value;
    }
    sum += value;
    sum_squares += (uint64_t)((int64_t)value * value);
  }

  mean = (int32_t)(sum / (int64_t)count);
  display_center_mv = (config->center_auto != 0U) ?
                      ScopeRawToMv(mean) : config->center_mv;
  {
    int64_t mean_square = (int64_t)(sum_squares / count);
    int64_t dc_square = (int64_t)mean * mean;
    variance = (mean_square > dc_square) ?
               (uint64_t)(mean_square - dc_square) : 0U;
  }
  rms_raw = ScopeIntegerSqrt(variance);

  {
    uint32_t elapsed_cycles =
        scope_snapshot_cycles[count - 1U] - scope_snapshot_cycles[0];
    if (elapsed_cycles != 0U)
    {
      display_sample_rate_hz = (uint32_t)
          (((uint64_t)(count - 1U) * SystemCoreClock) / elapsed_cycles);
    }
  }
  input_sample_rate_hz = display_sample_rate_hz * config->decimation;
  scope_input_sample_rate_hz = input_sample_rate_hz;

  /*
   * A Schmitt-style trigger rejects small zero-crossing noise. The trigger
   * follows the measured DC mean independently of the selected display
   * center voltage.
   */
  hysteresis = ((int32_t)maximum - (int32_t)minimum) / 20;
  if (hysteresis < 8)
  {
    hysteresis = 8;
  }

  for (uint32_t i = 0U; i < count; ++i)
  {
    int32_t value = scope_snapshot_samples[i];
    if (value <= (mean - hysteresis))
    {
      trigger_armed = 1U;
    }
    else if ((trigger_armed != 0U) && (value >= (mean + hysteresis)))
    {
      if (crossing_count < (sizeof(crossings) / sizeof(crossings[0])))
      {
        crossings[crossing_count++] = i;
      }
      else
      {
        memmove(&crossings[0], &crossings[1],
                (sizeof(crossings) / sizeof(crossings[0]) - 1U) *
                sizeof(crossings[0]));
        crossings[(sizeof(crossings) / sizeof(crossings[0])) - 1U] = i;
      }
      trigger_armed = 0U;
    }
  }

  if (crossing_count >= 2U)
  {
    uint32_t first_period = (crossing_count > 6U) ?
                            (crossing_count - 6U) : 1U;
    uint32_t periods = crossing_count - first_period;
    uint32_t total_samples =
        crossings[crossing_count - 1U] - crossings[first_period - 1U];
    uint32_t total_cycles =
        scope_snapshot_cycles[crossings[crossing_count - 1U]] -
        scope_snapshot_cycles[crossings[first_period - 1U]];

    if ((periods != 0U) && (total_samples != 0U))
    {
      period_samples = total_samples / periods;
    }
    if ((periods != 0U) && (total_cycles != 0U))
    {
      uint32_t average_period_cycles = total_cycles / periods;
      if (average_period_cycles != 0U)
      {
        frequency_millihz = (uint32_t)
            (((uint64_t)SystemCoreClock * 1000U) / average_period_cycles);
      }
    }
  }

  {
    int32_t newest_mv =
        ScopeRawToMv(scope_snapshot_samples[count - 1U]);
    int32_t dc_mv = ScopeRawToMv(mean);
    uint32_t peak_to_peak_mv = (uint32_t)ScopeRawToMv(
        (int32_t)maximum - (int32_t)minimum);
    uint32_t amplitude_mv = (peak_to_peak_mv + 1U) / 2U;
    uint32_t rms_mv = (uint32_t)ScopeRawToMv((int32_t)rms_raw);

